In [1]:
import pandas as pd
df=pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [3]:
target=df.Survived
inputs=df.drop(['Survived'],axis='columns')

In [4]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [5]:
inputs=pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [6]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [7]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [8]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [9]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(inputs.drop(['Sex'],axis='columns'),target,test_size=0.2)

In [10]:
len(X_train)

712

In [19]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [20]:
model.fit(X_train,y_train)

GaussianNB()

In [21]:
model.score(X_train,y_train)

0.7752808988764045

In [22]:
X_test[:10]

     Pclass        Age      Fare  female  male
862       1  48.000000   25.9292       1     0
126       3  29.699118    7.7500       0     1
527       1  29.699118  221.7792       0     1
836       3  21.000000    8.6625       0     1
192       3  19.000000    7.8542       1     0
770       3  24.000000    9.5000       0     1
415       3  29.699118    8.0500       1     0
490       3  29.699118   19.9667       0     1
587       1  60.000000   79.2000       0     1
421       3  21.000000    7.7333       0     1

In [23]:
y_test[:10]

862    1
126    0
527    0
836    0
192    1
770    0
415    0
490    0
587    1
421    0
Name: Survived, dtype: int64

In [24]:
model.predict(X_test[:10])

array([1, 0, 1, 0, 1, 0, 1, 0, 0, 0], dtype=int64)

In [25]:
model.predict_proba(X_test[:10])

array([[1.00027237e-02, 9.89997276e-01],
       [9.87732311e-01, 1.22676890e-02],
       [7.93408068e-08, 9.99999921e-01],
       [9.85721897e-01, 1.42781030e-02],
       [5.81949874e-02, 9.41805013e-01],
       [9.86690033e-01, 1.33099668e-02],
       [7.09636274e-02, 9.29036373e-01],
       [9.87844488e-01, 1.21555124e-02],
       [5.81413422e-01, 4.18586578e-01],
       [9.85646856e-01, 1.43531436e-02]])